print("""Вот твой первый вопрос:
кто был первым президентом России
1. Путин Владимир Владимирович
2. Eльцин Борис Николаевич
3. Медведев Дмитрий Анатольевич
4. Мишустин Михаил Владимирович""")

anwser_one = int(input("Введите ответ: "))
if anwser_one == 2:
    print("yes")
    print("""Второй вопрос: 
кто основатель компании Microsoft
1. Уильям (Билл) Гейст
2. Стив Джобс
3. Илон Маск
4. Марк Цукерберг""")

    anwser_two = int(input("Введите ответ: "))
    if anwser_two == 1:
        print("yes")
        print("""Третий вопрос: 
что полезнее
1. чипсы
2. газировка
3. яблоко
4. бургер""")
        anwser_three = int(input("Введите ответ: "))
        if anwser_three == 3:
            print("yes")
            print("""Четвёртый вопрос:
что быстрее
1. Звук
2. Машина
3. Человек
4. Свет""")
            anwser_four = int(input("Введите ответ: "))
            if anwser_four == 4:
                print("yes")
                print("""Пятый вопрос: 
кто был первым президентом России
1. Путин Владимир Владимирович
2. Eльцин Борис Николаевич
3. Медведев Дмитрий Анатольевич
4. Мишустин Михаил Владимирович""")

                anwser_five = int(input("Введите ответ: "))
                if anwser_five == 2:
                    print("yes")
                    print("""Шестой вопрос:
Кто был первым президентом России
1. Путин Владимир Владимирович
2. Eльцин Борис Николаевич
3. Медведев Дмитрий Анатольевич
4. Мишустин Михаил Владимирович""")
                    anwser_six = int(input("Введите ответ: "))
                    if anwser_six == 2:
                        print("yes")
                        print("""Седьмой вопрос:
кто был первым президентом России
1. Путин Владимир Владимирович
2. Eльцин Борис Николаевич
3. Медведев Дмитрий Анатольевич
4. Мишустин Михаил Владимирович""")
                        anwser_seven = int(input("Введите ответ: "))
                        if anwser_seven == 2:
                            print("yes")
                            print("""Восьмой вопрос: 
кто был первым президентом России
1. Путин Владимир Владимирович
2. Eльцин Борис Николаевич
3. Медведев Дмитрий Анатольевич
4. Мишустин Михаил Владимирович""")
                            anwser_eight = int(input("Введите ответ: "))
                            if anwser_eight == 2:
                                print("yes")
                                print("""Девятый вопрос: 
кто был первым президентом России
1. Путин Владимир Владимирович
2. Eльцин Борис Николаевич
3. Медведев Дмитрий Анатольевич
4. Мишустин Михаил Владимирович""")
                                anwser_nine = int(input("Введите ответ: "))
                                if anwser_nine == 2:
                                    print("yes")
                                    print("""Десятый вопрос:
кто был первым президентом России
1. Путин Владимир Владимирович
2. Eльцин Борис Николаевич
3. Медведев Дмитрий Анатольевич
4. Мишустин Михаил Владимирович""")
                                    anwser_ten = int(input("Введите ответ: "))
                                    if anwser_ten == 2:
                                        print("yes")
                                        print("Поздравляю, вы победили, ваш выйгрышь 1.000k")
                                    else:
                                        print("no")
                                        print("Вы проиграли, ваш 700к")
                                else:
                                    print("no")
                                    print("Вы проиграли, ваш 700к")
                            else:
                                print("no")
                                print("Вы проиграли, ваш 700к")
                        else:
                            print("no")
                            print("Вы проиграли, ваш 300к")
                    else:
                        print("no")
                        print("Вы проиграли, ваш 300к")
                else:
                    print("no")
                    print("Вы проиграли, ваш 300к")
            else:
                print("no")
                print("Вы проиграли, ваш 300к")
        else:
            print("no")
            print("Вы проиграли, ваш 0")
    else:
        print("no")
        print("Вы проиграли, ваш 0")
else:
    print("no")
    print("Вы проиграли, ваш 0")
